{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day",
        "What's up"
      ],
      "responses": [
        "Hey :-)",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "tag": "items",
      "patterns": [
        "Which items do you have?",
        "What kinds of items are there?",
        "What do you sell?",
        "What kind of productsdo you have?",
        "What kind of products?",
        "products?"
      ],
      "responses": [
        "We sell fruits and vegetables",
        "We have fresh fruits and vegetables"
      ]
    },
    {
      "tag": "delivery",
      "patterns": [
        "How long does delivery take?",
        "How long does shipping take?",
        "When do I get my delivery?"
      ],
      "responses": [
        "Delivery takes 2-4 days",
        "Shipping takes 2-4 days",
        "Shipping times vary depending on the destination and the shipping method chosen. Standard shipping usually takes 3-5 business days, while express shipping can take 2-4 business days."
      ]
    },
    {
      "tag": "funny",
      "patterns": [
        "Tell me a joke!",
        "Tell me something funny!",
        "Do you know a joke?"
      ],
      "responses": [
        "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
        "What did the buffalo say when his son left for college? Bison."
      ]
    },
    {
      "tag": "account",
      "patterns": [
        "How can I create an account?",
        "Create an account",
        "Register an account"
      ],
      "responses": [
        "To create an account, click on the 'Sign Up' button on the top right corner of our website and follow the instructions to complete the registration process."
      ]
    },
    {
      "tag": "payments",
      "patterns": [
        "What payment methods do you accept?",
        "Payment methods",
        "How many payment methods do you accept?",
        "What payment methods I can use?",
        "Payment",
        "Do you take credit cards?",
        "Do you accept Mastercard?",
        "Can I pay with Paypal?",
        "Are you cash only?"
      ],
      "responses": [
        "We accept major cash on delevery, VNPAY, and PayPal as payment methods for online orders."
      ]
    },
    {
      "tag": "orders",
      "patterns": [
        "How can I track my order?",
        "Track my order",
        "Track the order"
      ],
      "responses": [
        "You can track your order by logging into your account and navigating to the 'Orders' page. There, you will find the tracking information for your shipment."
      ]
    },
    {
      "tag": "return policy",
      "patterns": [
        "What is your return policy?"
      ],
      "responses": [
        "Our return policy allows you to return products within 30 days of purchase for a full refund, provided they are in their original condition and packaging. Please refer to our Returns page for detailed instructions."
      ]
    },
    {
      "tag": "cancel order",
      "patterns": [
        "Can I cancel my order?",
        "Cancel the order",
        "Cancel my order"
      ],
      "responses": [
        "You can cancel your order if it's status is pending. Please contact our customer support team with your order details, and we will assist you with the cancellation process."
      ]
    },
    {
      "tag": "international shipping",
      "patterns": [
        "Do you offer international shipping?"
      ],
      "responses": [
        "Yes, we offer international shipping to select countries. The availability and shipping costs will be calculated during the checkout process based on your location."
      ]
    },
    {
      "tag": "v6owq5bmfxs",
      "patterns": [
        "What should I do if my package is lost or damaged?"
      ],
      "responses": [
        "If your package is lost or damaged during transit, please contact our customer support team immediately. We will initiate an investigation and take the necessary steps to resolve the issue."
      ]
    },
    {
      "tag": "baa09p0zccg",
      "patterns": [
        "Can I change my shipping address after placing an order?"
      ],
      "responses": [
        "If you need to change your shipping address, please contact our customer support team as soon as possible. We will do our best to update the address if the order has not been shipped yet."
      ]
    },
    {
      "tag": "nyjb0wbtwb",
      "patterns": [
        "How can I contact customer support?",
        "Contact customer support?",
        "Customer support"
      ],
      "responses": [
        "You can contact our customer support team by phone at [0917768940] or by chatting function. Our team is available 24/7 to assist you with any inquiries or issues you may have."
      ]
    },
    {
      "tag": "z21s6cgxage",
      "patterns": [
        "Do you offer gift wrapping services?"
      ],
      "responses": [
        "Yes, we offer gift wrapping services for an additional fee. During the checkout process, you can select the option to add gift wrapping to your order."
      ]
    },
    {
      "tag": "ds589ndm7js",
      "patterns": [
        "What is your price matching policy?"
      ],
      "responses": [
        "We have a price matching policy where we will match the price of an identical product found on a competitor's website. Please contact our customer support team with the details of the product and the competitor's offer."
      ]
    },
    {
      "tag": "azu3yztkfou",
      "patterns": [
        "Can I order by phone?",
        "Can I use phone to order?"
      ],
      "responses": [
        "Unfortunately, we do not accept orders over the phone. Please place your order through our website for a smooth and secure transaction."
      ]
    },
    {
      "tag": "kre7u651idd",
      "patterns": [
        "Are my personal and payment details secure?"
      ],
      "responses": [
        "Yes, we take the security of your personal and payment details seriously. We use industry-standard encryption and follow strict security protocols to ensure your information is protected."
      ]
    },
    {
      "tag": "q9040nze8n",
      "patterns": [
        "What is your price adjustment policy?"
      ],
      "responses": [
        "If a product you purchased goes on sale within 7 days of your purchase, we offer a one-time price adjustment. Please contact our customer support team with your order details to request the adjustment."
      ]
    },
    {
      "tag": "v5qggnwlz49",
      "patterns": [
        "Do you have a loyalty program?"
      ],
      "responses": [
        "Yes, we have a loyalty program where you can earn points for every purchase. These points can be redeemed for discounts on future orders. Please visit our website to learn more and join the program."
      ]
    },
    {
      "tag": "sm97aec3d2g",
      "patterns": [
        "Can I order without creating an account?"
      ],
      "responses": [
        "No, you can't place an order as a guest without creating an account. Therefore, creating an account offers benefits such as order tracking and easier future purchases."
      ]
    },
    {
      "tag": "vi9z73u291j",
      "patterns": [
        "Do you offer bulk or wholesale discounts?"
      ],
      "responses": [
        "Yes, we offer bulk or wholesale discounts for certain products. Please contact our customer support team or visit our Wholesale page for more information and to discuss your specific requirements."
      ]
    },
    {
      "tag": "8jubllkgcw4",
      "patterns": [
        "Can I change or cancel an item in my order?"
      ],
      "responses": [
        "If you need to change or cancel an item in your order, please contact our customer support team as soon as possible. We will assist you with the necessary steps."
      ]
    },
    {
      "tag": "70u05q9bo6h",
      "patterns": [
        "How can I leave a product review?",
        "How can I evaluate a product?",
        "How can I review a product?",
        "How can I evaluate an item?",
        "How can I review an item?",
        "How can I evaluate?",
        "How can I review?"
      ],
      "responses": [
        "To leave a product review, navigate to the product page on our website and click on the 'Write a Review' button. You can share your feedback and rating based on your experience with the product."
      ]
    },
    {
      "tag": "rbaya9xwpu",
      "patterns": [
        "Can I use multiple promo codes on a single order?"
      ],
      "responses": [
        "Usually, only one promo code can be applied per order. During the checkout process, enter the promo code in the designated field to apply the discount to your order."
      ]
    },
    {
      "tag": "bcqk6w03dop",
      "patterns": [
        "What should I do if I receive the wrong item?"
      ],
      "responses": [
        "If you receive the wrong item in your order, please contact our customer support team immediately. We will arrange for the correct item to be shipped to you and assist with returning the wrong item."
      ]
    },
    {
      "tag": "i7md5kzh557",
      "patterns": [
        "Do you offer expedited shipping?"
      ],
      "responses": [
        "Yes, we offer expedited shipping options for faster delivery. During the checkout process, you can select the desired expedited shipping method."
      ]
    },
    {
      "tag": "2r5waw87ypo",
      "patterns": [
        "Can I order a product that is out of stock?"
      ],
      "responses": [
        "If a product is currently out of stock, you will usually see an option to sign up for product notifications. This way, you will be alerted when the product becomes available again."
      ]
    },
    {
      "tag": "novuj4oken",
      "patterns": [
        "What is your email newsletter about?"
      ],
      "responses": [
        "Our email newsletter provides updates on new product releases, exclusive offers, and helpful tips related to our products. You can subscribe to our newsletter on our website."
      ]
    },
    {
      "tag": "444iul74lfh",
      "patterns": [
        "Can I return a product if I changed my mind?"
      ],
      "responses": [
        "Yes, you can return a product if you changed your mind. Please ensure the product is in its original condition and packaging, and refer to our return policy for instructions."
      ]
    },
    {
      "tag": "qkg59x8b1w",
      "patterns": [
        "Do you offer live chat support?"
      ],
      "responses": [
        "Yes, we offer live chat support on our website during our business hours. Look for the chat icon in the bottom right corner to initiate a chat with our customer support team."
      ]
    },
    {
      "tag": "ced399hgcqg",
      "patterns": [
        "Can I order a product as a gift?"
      ],
      "responses": [
        "Yes, you can order a product as a gift and have it shipped directly to the recipient. During the checkout process, you can enter the recipient's shipping address."
      ]
    },
    {
      "tag": "tjw6ytnq1p",
      "patterns": [
        "What should I do if my discount code is not working?"
      ],
      "responses": [
        "If your discount code is not working, please double-check the terms and conditions associated with the code. If the issue persists, contact our customer support team for assistance."
      ]
    },
    {
      "tag": "ydyyvk8gu8h",
      "patterns": [
        "Can I return a product if it was a final sale item?"
      ],
      "responses": [
        "Final sale items are usually non-returnable and non-refundable. Please review the product description or contact our customer support team to confirm the return eligibility for specific items."
      ]
    },
    {
      "tag": "jl98fgdchpf",
      "patterns": [
        "Do you offer installation services for your products?"
      ],
      "responses": [
        "Installation services are available for select products. Please check the product description or contact our customer support team for more information and to request installation services."
      ]
    },
    {
      "tag": "ognz23zid4r",
      "patterns": [
        "Can I order a product that is discontinued?"
      ],
      "responses": [
        "Discontinued products are no longer available for purchase. We recommend exploring alternative products on our website."
      ]
    },
    {
      "tag": "otsqlvlzd7r",
      "patterns": [
        "Can I return a product without a receipt?"
      ],
      "responses": [
        "A receipt or proof of purchase is usually required for returns. Please refer to our return policy or contact our customer support team for assistance."
      ]
    },
    {
      "tag": "qd9832h7ye",
      "patterns": [
        "Can I order a product for delivery to a different country?"
      ],
      "responses": [
        "Yes, we offer international shipping to select countries. Please review the available shipping destinations during checkout or contact our customer support for assistance."
      ]
    },
    {
      "tag": "f0llhio0zi",
      "patterns": [
        "Can I add a gift message to my order?"
      ],
      "responses": [
        "Yes, you can add a gift message during the checkout process. There is usually a section where you can enter your personalized message."
      ]
    },
    {
      "tag": "haqwmca81rg",
      "patterns": [
        "Can I request a product demonstration before making a purchase?"
      ],
      "responses": [
        "We do not currently offer product demonstrations before purchase. However, you can find detailed product descriptions, specifications, and customer reviews on our website."
      ]
    },
    {
      "tag": "zu2iio0ptgj",
      "patterns": [
        "Can I order a product that is listed as 'coming soon'?"
      ],
      "responses": [
        "Products listed as 'coming soon' are not available for immediate purchase. Please sign up for notifications to be informed when the product becomes available."
      ]
    },
    {
      "tag": "wyugxmv998",
      "patterns": [
        "Can I request an invoice for my order?"
      ],
      "responses": [
        "Yes, an invoice is usually included with your order. If you require a separate invoice, please contact our customer support team with your order details."
      ]
    },
    {
      "tag": "syfix5t795r",
      "patterns": [
        "Can I order a product that is labeled as 'limited edition'?"
      ],
      "responses": [
        "'Limited edition' products may have restricted availability. We recommend placing an order as soon as possible to secure your item."
      ]
    },
    {
      "tag": "xzn0e8jj2zl",
      "patterns": [
        "Can I return a product if I no longer have the original packaging?"
      ],
      "responses": [
        "While returning a product in its original packaging is preferred, you can still initiate a return without it. Contact our customer support team for guidance in such cases."
      ]
    },
    {
      "tag": "kqdtchz0rw",
      "patterns": [
        "Can I request a product that is currently out of stock to be reserved for me?"
      ],
      "responses": [
        "We do not offer reservations for out-of-stock products. However, you can sign up for product notifications to be alerted when it becomes available again."
      ]
    },
    {
      "tag": "48h76fehhta",
      "patterns": [
        "Can I order a product that is listed as 'pre-order' with other in-stock items?"
      ],
      "responses": [
        "Yes, you can place an order with a mix of pre-order and in-stock items. However, please note that the entire order will be shipped once all items are available."
      ]
    },
    {
      "tag": "pzvln2v6t0q",
      "patterns": [
        "Can I return a product if it was damaged during shipping?"
      ],
      "responses": [
        "If your product was damaged during shipping, please contact our customer support team immediately. We will guide you through the return and replacement process."
      ]
    },
    {
      "tag": "zrc2lqiqwhb",
      "patterns": [
        "Can I request a product that is out of stock to be restocked?"
      ],
      "responses": [
        "We strive to restock popular products whenever possible. Please sign up for product notifications to be informed when the item becomes available again."
      ]
    },
    {
      "tag": "wmb31mp65h",
      "patterns": [
        "Can I order a product if it is listed as 'backordered'?"
      ],
      "responses": [
        "Products listed as 'backordered' are temporarily out of stock but can still be ordered. Your order will be fulfilled once the product is restocked."
      ]
    },
    {
      "tag": "hdjo97hldhk",
      "patterns": [
        "Can I return a product if it was purchased during a sale or with a discount?"
      ],
      "responses": [
        "Yes, you can return a product purchased during a sale or with a discount. The refund will be processed based on the amount paid after the discount."
      ]
    },
    {
      "tag": "m4tn51ozio",
      "patterns": [
        "Can I request a product repair or replacement if it is damaged?"
      ],
      "responses": [
        "If you receive a damaged product, please contact our customer support team immediately. We will assist you with the necessary steps for repair or replacement."
      ]
    },
    {
      "tag": "dui1rz7gnhv",
      "patterns": [
        "Can I order a product if it is listed as 'out of stock' but available for pre-order?"
      ],
      "responses": [
        "If a product is available for pre-order, you can place an order to secure your item. The product will be shipped once it becomes available."
      ]
    },
    {
      "tag": "75s1ri508o5",
      "patterns": [
        "Can I return a product if it was purchased as a gift?"
      ],
      "responses": [
        "Yes, you can return a product purchased as a gift. However, refunds will typically be issued to the original payment method used for the purchase."
      ]
    },
    {
      "tag": "kxalgqtsgyn",
      "patterns": [
        "Can I request a product if it is listed as 'discontinued'?"
      ],
      "responses": [
        "Unfortunately, if a product is listed as 'discontinued,' it is no longer available for purchase. We recommend exploring alternative products on our website."
      ]
    },
    {
      "tag": "ku7o8w451gj",
      "patterns": [
        "Can I order a product if it is listed as 'sold out'?"
      ],
      "responses": [
        "If a product is listed as 'sold out,' it is currently unavailable for purchase. Please check back later or sign up for notifications when it becomes available again."
      ]
    },
    {
      "tag": "dw8vau4qwu4",
      "patterns": [
        "Can I return a product if it was purchased with a gift card?"
      ],
      "responses": [
        "Yes, you can return a product purchased with a gift card. The refund will be issued in the form of store credit or a new gift card."
      ]
    },
    {
      "tag": "l2qvrbn2cy",
      "patterns": [
        "Can I request a product if it is not currently available in my size?"
      ],
      "responses": [
        "If a product is not available in your size, it may be temporarily out of stock. Please check back later or sign up for size notifications."
      ]
    },
    {
      "tag": "d1ouw70aypd",
      "patterns": [
        "Can I order a product if it is listed as 'coming soon' but available for pre-order?"
      ],
      "responses": [
        "If a product is listed as 'coming soon' and available for pre-order, you can place an order to secure your item before it becomes available."
      ]
    },
    {
      "tag": "6psf0dy4knr",
      "patterns": [
        "Can I return a product if it was purchased with a discount code?"
      ],
      "responses": [
        "Yes, you can return a product purchased with a discount code. The refund will be processed based on the amount paid after the discount."
      ]
    },
    {
      "tag": "zvepebnps3",
      "patterns": [
        "Can I request a custom order or personalized product?"
      ],
      "responses": [
        "We do not currently offer custom orders or personalized products. Please explore the available products on our website."
      ]
    },
    {
      "tag": "z836mtyloki",
      "patterns": [
        "Can I order a product if it is listed as 'temporarily unavailable'?"
      ],
      "responses": [
        "If a product is listed as 'temporarily unavailable,' it is out of stock but may be restocked in the future. Please check back later or sign up for notifications."
      ]
    },
    {
      "tag": "e9ncou6cvfp",
      "patterns": [
        "Can I return a product if it was damaged due to improper use?"
      ],
      "responses": [
        "Our return policy generally covers products that are defective or damaged upon arrival. Damage due to improper use may not be eligible for a return. Please contact our customer support team for assistance."
      ]
    },
    {
      "tag": "yquhvomej58",
      "patterns": [
        "Can I request a product if it is listed as 'coming soon' but not available for pre-order?"
      ],
      "responses": [
        "If a product is listed as 'coming soon' but not available for pre-order, you will need to wait until it is officially released and becomes available for purchase."
      ]
    },
    {
      "tag": "jjx7yp3pfv",
      "patterns": [
        "Can I order a product if it is listed as 'on hold'?"
      ],
      "responses": [
        "If a product is listed as 'on hold,' it is temporarily unavailable for purchase. Please check back later or sign up for notifications when it becomes available."
      ]
    },
    {
      "tag": "xrenay681ep",
      "patterns": [
        "Can I return a product if I no longer have the original receipt?"
      ],
      "responses": [
        "While a receipt is preferred for returns, we may be able to assist you without it. Please contact our customer support team for further guidance."
      ]
    },
    {
      "tag": "c4tt5qkjzf9",
      "patterns": [
        "Can I request a product that is listed as 'limited edition' to be restocked?"
      ],
      "responses": [
        "Once a limited edition product is sold out, it may not be restocked. Limited edition items are available for a limited time only, so we recommend purchasing them while they are available."
      ]
    },
    {
      "tag": "jn6exs2im9",
      "patterns": [
        "Can I order a product if it is listed as 'discontinued' but still visible on the website?"
      ],
      "responses": [
        "If a product is listed as 'discontinued' but still visible on the website, it may be an error. Please contact our customer support team for clarification."
      ]
    },
    {
      "tag": "fdhqzsx7dde",
      "patterns": [
        "Can I return a product if it was a clearance or final sale item?"
      ],
      "responses": [
        "Clearance or final sale items are typically non-returnable and non-refundable. Please review the product description or contact our customer support team for more information."
      ]
    },
    {
      "tag": "w36y0llfwe",
      "patterns": [
        "Can I request a product if it is not listed on your website?"
      ],
      "responses": [
        "If a product is not listed on our website, it may not be available for purchase. We recommend exploring the available products or contacting our customer support team for further assistance."
      ]
    },
    {
      "tag": "r90pmqw34m",
      "patterns": [
        "Can I order a product if it is listed as 'out of stock' but available for backorder?"
      ],
      "responses": [
        "If a product is listed as 'out of stock' but available for backorder, you can place an order to secure your item. The product will be shipped once it becomes available."
      ]
    },
    {
      "tag": "k1y3fa6y84s",
      "patterns": [
        "Can I return a product if it was purchased as part of a bundle or set?"
      ],
      "responses": [
        "If a product was purchased as part of a bundle or set, the return policy may vary. Please refer to the specific terms and conditions or contact our customer support team for further guidance."
      ]
    },
    {
      "tag": "deq813csiik",
      "patterns": [
        "Can I request a product that is listed as 'out of stock' to be restocked?"
      ],
      "responses": [
        "We aim to restock popular products whenever possible. Please sign up for product notifications to be alerted when the item becomes available again."
      ]
    },
    {
      "tag": "o36qvz3xljp",
      "patterns": [
        "Can I order a product if it is listed as 'coming soon' and available for pre-order?"
      ],
      "responses": [
        "If a product is listed as 'coming soon' and available for pre-order, you can place an order to secure your item before it becomes available."
      ]
    },
    {
      "tag": "2ifxs5s8hdr",
      "patterns": [
        "Can I return a product if it was damaged due to mishandling during shipping?"
      ],
      "responses": [
        "If your product was damaged due to mishandling during shipping, please contact our customer support team immediately. We will assist you with the necessary steps for return and replacement."
      ]
    },
    {
      "tag": "ext7hwacou9",
      "patterns": [
        "Can I request a product that is listed as 'out of stock' to be reserved for me?"
      ],
      "responses": [
        "We do not offer reservations for out-of-stock products. However, you can sign up for product notifications to be alerted when the item becomes available again."
      ]
    },
    {
      "tag": "gbhay6pi05",
      "patterns": [
        "Can I order a product if it is listed as 'pre-order' but available for backorder?"
      ],
      "responses": [
        "If a product is listed as 'pre-order' and available for backorder, you can place an order to secure your item. The product will be shipped once it becomes available."
      ]
    },
    {
      "tag": "ozweqwevobg",
      "patterns": [
        "Can I return a product if it was purchased with store credit?"
      ],
      "responses": [
        "Yes, you can return a product purchased with store credit. The refund will be issued in the form of store credit, which you can use for future purchases."
      ]
    },
    {
      "tag": "8i4j9ngx84",
      "patterns": [
        "Can I request a product that is currently out of stock to be restocked?"
      ],
      "responses": [
        "We strive to restock popular products whenever possible. Please sign up for product notifications to be informed when the item becomes available again."
      ]
    },
    {
      "tag": "ylqkml4r8ol",
      "patterns": [
        "Can I order a product if it is listed as 'sold out' but available for pre-order?"
      ],
      "responses": [
        "If a product is listed as 'sold out' but available for pre-order, you can place an order to secure your item. The product will be shipped once it becomes available."
      ]
    },
    {
      "tag": "xeam24g3q5s",
      "patterns": [
        "Can I return a product if it was purchased with a promotional gift card?"
      ],
      "responses": [
        "Yes, you can return a product purchased with a promotional gift card. The refund will be issued in the form of store credit or a new gift card."
      ]
    },
    {
      "tag": "83x04oqdtei",
      "patterns": [
        "Can I request a product if it is not currently available in my preferred color?"
      ],
      "responses": [
        "If a product is not available in your preferred color, it may be temporarily out of stock. Please check back later or sign up for color notifications."
      ]
    },
    {
      "tag": "di1t0ixmf39",
      "patterns": [
        "Can I order a product if it is listed as 'coming soon' and not available for pre-order?"
      ],
      "responses": [
        "If a product is listed as 'coming soon' but not available for pre-order, you will need to wait until it is officially released and becomes available for purchase."
      ]
    },
    {
      "tag": "78616eed5tu",
      "patterns": [
        "Can I return a product if it was purchased during a promotional event?"
      ],
      "responses": [
        "Yes, you can return a product purchased during a promotional event. The refund will be processed based on the amount paid after any applicable discounts."
      ]
    },
    {
      "tag": "78616eed5tu",
      "patterns": [
        "What is the best selling product?"
      ],
      "responses": [
        "Apple is the best selling product"
      ]
    }
  ]
}
